Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAK169.atdf
         <register caption="" name="GLCDCURDATA113" offset="0x9C4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2815" />
            <bitfield mask="0x000000F0" name="PIXEL2814" />
            <bitfield mask="0x00000F00" name="PIXEL2813" />
            <bitfield mask="0x0000F000" name="PIXEL2812" />
            <bitfield mask="0x000F0000" name="PIXEL2811" />
            <bitfield mask="0x00F00000" name="PIXEL2810" />
            <bitfield mask="0x0F000000" name="PIXEL289" />
            <bitfield mask="0xF0000000" name="PIXEL288" />
         </register>
         <register caption="" name="GLCDCURDATA114" offset="0x9C8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2823" />
            <bitfield mask="0x000000F0" name="PIXEL2822" />
            <bitfield mask="0x00000F00" name="PIXEL2821" />
            <bitfield mask="0x0000F000" name="PIXEL2820" />
            <bitfield mask="0x000F0000" name="PIXEL2819" />
            <bitfield mask="0x00F00000" name="PIXEL2818" />
            <bitfield mask="0x0F000000" name="PIXEL2817" />
            <bitfield mask="0xF0000000" name="PIXEL2816" />
         </register>
         <register caption="" name="GLCDCURDATA115" offset="0x9CC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2831" />
            <bitfield mask="0x000000F0" name="PIXEL2830" />
            <bitfield mask="0x00000F00" name="PIXEL2829" />
            <bitfield mask="0x0000F000" name="PIXEL2828" />
            <bitfield mask="0x000F0000" name="PIXEL2827" />
            <bitfield mask="0x00F00000" name="PIXEL2826" />
            <bitfield mask="0x0F000000" name="PIXEL2825" />
            <bitfield mask="0xF0000000" name="PIXEL2824" />
         </register>
         <register caption="" name="GLCDCURDATA116" offset="0x9D0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL297" />
            <bitfield mask="0x000000F0" name="PIXEL296" />
            <bitfield mask="0x00000F00" name="PIXEL295" />
            <bitfield mask="0x0000F000" name="PIXEL294" />
            <bitfield mask="0x000F0000" name="PIXEL293" />
            <bitfield mask="0x00F00000" name="PIXEL292" />
            <bitfield mask="0x0F000000" name="PIXEL291" />
            <bitfield mask="0xF0000000" name="PIXEL290" />
         </register>
         <register caption="" name="GLCDCURDATA117" offset="0x9D4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2915" />
            <bitfield mask="0x000000F0" name="PIXEL2914" />
            <bitfield mask="0x00000F00" name="PIXEL2913" />
            <bitfield mask="0x0000F000" name="PIXEL2912" />
            <bitfield mask="0x000F0000" name="PIXEL2911" />
            <bitfield mask="0x00F00000" name="PIXEL2910" />
            <bitfield mask="0x0F000000" name="PIXEL299" />
            <bitfield mask="0xF0000000" name="PIXEL298" />
         </register>
         <register caption="" name="GLCDCURDATA118" offset="0x9D8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2923" />
            <bitfield mask="0x000000F0" name="PIXEL2922" />
            <bitfield mask="0x00000F00" name="PIXEL2921" />
            <bitfield mask="0x0000F000" name="PIXEL2920" />
            <bitfield mask="0x000F0000" name="PIXEL2919" />
            <bitfield mask="0x00F00000" name="PIXEL2918" />
            <bitfield mask="0x0F000000" name="PIXEL2917" />
            <bitfield mask="0xF0000000" name="PIXEL2916" />
         </register>
         <register caption="" name="GLCDCURDATA119" offset="0x9DC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL2931" />
            <bitfield mask="0x000000F0" name="PIXEL2930" />
            <bitfield mask="0x00000F00" name="PIXEL2929" />
            <bitfield mask="0x0000F000" name="PIXEL2928" />
            <bitfield mask="0x000F0000" name="PIXEL2927" />
            <bitfield mask="0x00F00000" name="PIXEL2926" />
            <bitfield mask="0x0F000000" name="PIXEL2925" />
            <bitfield mask="0xF0000000" name="PIXEL2924" />
         </register>
         <register caption="" name="GLCDCURDATA120" offset="0x9E0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL307" />
            <bitfield mask="0x000000F0" name="PIXEL306" />
            <bitfield mask="0x00000F00" name="PIXEL305" />
            <bitfield mask="0x0000F000" name="PIXEL304" />
            <bitfield mask="0x000F0000" name="PIXEL303" />
            <bitfield mask="0x00F00000" name="PIXEL302" />
            <bitfield mask="0x0F000000" name="PIXEL301" />
            <bitfield mask="0xF0000000" name="PIXEL300" />
         </register>
         <register caption="" name="GLCDCURDATA121" offset="0x9E4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL3015" />
            <bitfield mask="0x000000F0" name="PIXEL3014" />
            <bitfield mask="0x00000F00" name="PIXEL3013" />
            <bitfield mask="0x0000F000" name="PIXEL3012" />
            <bitfield mask="0x000F0000" name="PIXEL3011" />
            <bitfield mask="0x00F00000" name="PIXEL3010" />
            <bitfield mask="0x0F000000" name="PIXEL309" />
            <bitfield mask="0xF0000000" name="PIXEL308" />
         </register>
         <register caption="" name="GLCDCURDATA122" offset="0x9E8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL3023" />
            <bitfield mask="0x000000F0" name="PIXEL3022" />
            <bitfield mask="0x00000F00" name="PIXEL3021" />
            <bitfield mask="0x0000F000" name="PIXEL3020" />
            <bitfield mask="0x000F0000" name="PIXEL3019" />
            <bitfield mask="0x00F00000" name="PIXEL3018" />
            <bitfield mask="0x0F000000" name="PIXEL3017" />
            <bitfield mask="0xF0000000" name="PIXEL3016" />
         </register>
         <register caption="" name="GLCDCURDATA123" offset="0x9EC" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL3031" />
            <bitfield mask="0x000000F0" name="PIXEL3030" />
            <bitfield mask="0x00000F00" name="PIXEL3029" />
            <bitfield mask="0x0000F000" name="PIXEL3028" />
            <bitfield mask="0x000F0000" name="PIXEL3027" />
            <bitfield mask="0x00F00000" name="PIXEL3026" />
            <bitfield mask="0x0F000000" name="PIXEL3025" />
            <bitfield mask="0xF0000000" name="PIXEL3024" />
         </register>
         <register caption="" name="GLCDCURDATA124" offset="0x9F0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="PIXEL317" />
            <bitfield mask="0x000000F0" name="PIXEL316" />
            <bitfield mask="0x00000F00" name="PIXEL315" />
            <bitfield mask="0x0000F000" name="PIXEL314" />
            <bitfield mask="0x000F0000" name="PIXEL313" />
            <bitfield mask="0x00F00000" name="PIXEL312" />
            <bitfield mask="0x0F000000" name="PIXEL311" />
            <bitfield mask="0xF0000000" name="PIXEL310" />
         </register>
